
def __init__():
	main()

def main():
	while True:
		menu()
		print('欢迎使用')
		input_num = int(input('请输入选择的选项...'))
		choice = [1,2,3,4,5,6]
		if (input_num in choice):
			if (input_num == 1):
				delete()
			elif (input_num == 2):
				insert()
			elif (input_num == 3):
				update()



def menu():
	print('=============================学生管理系统===============================')
	print('-------------------------------功能菜单---------------------------------')
	print('----------------------------1.删除学生信息------------------------------')
	print('----------------------------2.新增学生信息------------------------------')
	print('----------------------------3.修改学生信息------------------------------')
	print('----------------------------4.退出-------------------------------------')
